jomadmann/tinno77_s7505_kk_beta1/mediatek/custom/common/kernel/touchpanel/cy8ctst242/cy8ctst242.c
/*
 * cy8ctst242.c -- cy8ctst242 touch driver
 *
 * Copyright (C) 2012 Li Yang
 * All rights reserved.
 *
 */
#include "cy8ctst242.h"

extern struct tpd_device *tpd;
static struct task_struct *thread = NULL;
static DECLARE_WAIT_QUEUE_HEAD(waiter);
static struct early_suspend early_suspend;
#if 0
extern void mt65xx_eint_unmask(unsigned int line);
extern void mt65xx_eint_mask(unsigned int line);
extern void mt65xx_eint_set_hw_debounce(kal_uint8 eintno, kal_uint32 ms);
extern kal_uint32 mt65xx_eint_set_sens(kal_uint8 eintno, kal_bool sens);
extern void mt65xx_eint_set_polarity(unsigned int eint_num, unsigned int pol);
extern void mt65xx_eint_registration(kal_uint8 eintno, kal_bool Dbounce_En,
        kal_bool ACT_Polarity, void (EINT_FUNC_PTR)(void),
        kal_bool auto_umask);
#endif
static void tpd_eint_interrupt_handler(void);

static int __devinit tpd_probe(struct i2c_client *client, const struct i2c_device_id *id);
static int tpd_detect(struct i2c_client *client, int kind, struct i2c_board_info *info);
static int __devexit tpd_remove(struct i2c_client *client);
static int touch_event_handler(void *unused);
int g_bcy8stmstar = true;
//#define CY8CTST_BOOTLOADER
#define CY8CTST_SENSOR
//#define CY8CTST_DEBUG
#define GET_HSTMODE(reg)  ((reg & 0x70) >> 4)  // in op mode or not 
#define GET_BOOTLOADERMODE(reg) ((reg & 0x10) >> 4)  // in bl mode 
#define CY8CTST_VENDOR_REG 		0x10
#define CY8CTST_FW_REG 			0x11
#define CY8CTST_SENSOR_EN_REG 	0x12
#define CY8CTST_SENSOR_STATE_REG 	0x13
static int tpd_flag = 0;
static int boot_mode;
static int binit = 0;
extern int updating;

struct i2c_client_ctxt{
	 struct i2c_client *client;
	 struct mutex lock;
	 struct mutex power_lock;
};

static struct i2c_client_ctxt *_cy8ctst_client;

static uint8_t bootloader_exit_cmd[] = {
	0x00, 0x00, 0xFF, 0xA5, 
	0x00, 0x01, 0x02, 0x03, 
	0x04, 0x05, 0x06, 0x07
};

struct tpd_operation_data_t{
	uint8_t hst_mode; //0x00
	uint8_t tt_mode;
	uint8_t tt_stat;
	uint8_t x1_H;
	uint8_t x1_L;
	uint8_t y1_H;
	uint8_t y1_L;
	uint8_t z1;
	uint8_t touch12_id; //0x08
	uint8_t x2_H;
	uint8_t x2_L;
	uint8_t y2_H;
	uint8_t y2_L;
	uint8_t z2;
	uint8_t gest_cnt;
	uint8_t gest_id;
	uint8_t gest_set; //0x10
	uint8_t res1;
	uint8_t sensor_en; //0x12
	uint8_t sensor_state; //0x13
#ifdef CY8CTST_DEBUG
	uint8_t diff_L; //0x14
	uint8_t diff_H;
	uint8_t rawdata_L; //0x16
	uint8_t rawdata_H;
	uint8_t baseline_L; //0x18
	uint8_t baseline_H;
#endif
};

struct tpd_bootloader_data_t{
    uint8_t bl_file;
    uint8_t bl_status;
    uint8_t bl_error;
    uint8_t blver_hi,blver_lo;
    uint8_t bld_blver_hi,bld_blver_lo;

    uint8_t ttspver_hi,ttspver_lo;
    uint8_t appid_hi,appid_lo;
    uint8_t appver_hi,appver_lo;

    uint8_t cid_0;
    uint8_t cid_1;
    uint8_t cid_2;

};

struct tpd_sysinfo_data_t{
    uint8_t   hst_mode;
    uint8_t  mfg_cmd;
    uint8_t  mfg_stat;
    uint8_t cid[3];
    uint8_t tt_undef1;

    uint8_t uid[8];
    uint8_t  bl_verh;
    uint8_t  bl_verl;

    uint8_t tts_verh;
    uint8_t tts_verl;

    uint8_t app_idh;
    uint8_t app_idl;
    uint8_t app_verh;
    uint8_t app_verl;

    uint8_t tt_undef2[6];
    uint8_t  act_intrvl;
    uint8_t  tch_tmout;
    uint8_t  lp_intrvl;	 

};

struct touch_info {
    int x1, y1;
    int x2, y2;
    int p1, p2;
    int id1,id2;
    int count;
};

struct id_info{
    int pid1;
    int pid2;
    int reportid1;
    int reportid2;
    int id1;
    int id2;

};

struct cy8ctst_i2c_cmd 
{
	uint8_t opration;
	uint8_t addr;
	uint8_t reg;
	uint8_t cmd_buf[20];
	int cmd_length;
	int delay_time;
};

struct i2c_blk_info {
	uint8_t blk_buf[80];
	uint8_t blk_length;
};

#define MAX_READ_BYTE		8
#define I2C_UNKNOW_CMD		0x0f
#define I2C_READ_CMD		0
#define I2C_WRITE_CMD		1
#define I2C_DELAY_CMD		2
#define I2C_BIN_SIZE			200 * 1024
#ifdef CY8CTST242_USE_ALLOC_MEM
static uint8_t *i2c_bin_buf;
static struct cy8ctst_i2c_cmd *i2c_cmd_list;
#else
static uint8_t i2c_bin_buf[I2C_BIN_SIZE];
static struct cy8ctst_i2c_cmd i2c_cmd_list[50 * 1024];
#endif
static int total_cmd_num = 0;
static int process_cmd = 0;
static int sensor_open = 0;
static struct i2c_blk_info blk_list[800];
static int total_blk_num;

#if defined(MT6573)
static uint8_t *cy8ctst_dma_va = NULL;
static u32 cy8ctst_dma_pa = 0;
#endif

static struct tpd_operation_data_t g_operation_data;
static struct tpd_bootloader_data_t g_bootloader_data;
//static struct tpd_sysinfo_data_t g_sysinfo_data;

/*static const struct i2c_device_id tpd_id[] = {{TPD_DEVICE,0},{}};
static unsigned short force[] = {0,0x48,I2C_CLIENT_END,I2C_CLIENT_END};
static const unsigned short * const forces[] = { force, NULL };
static struct i2c_client_address_data addr_data = { .forces = forces, };
*/
#define DRIVER_NAME "cy8ctst242"
#define TPD_I2C_SLAVE_ADDR1 (0x48 >> 1)
#define TPD_I2C_GROUP_ID 0
static const struct i2c_device_id tpd_id[] = {{DRIVER_NAME,0},{}};
static struct i2c_board_info __initdata cy8ctst242_i2c_tpd[]={ {I2C_BOARD_INFO(DRIVER_NAME, TPD_I2C_SLAVE_ADDR1)}};
static struct i2c_driver tpd_i2c_driver = {
    .driver = {
        .name = TPD_DEVICE,
        .owner = THIS_MODULE,
    },
    .probe = tpd_probe,
    .remove = __devexit_p(tpd_remove),
    .id_table = tpd_id,
    .detect = tpd_detect,
 //   .address_data = &addr_data,
};

void cy8ctst_power(int on)
{
	mt6575_touch_info("+%s: on=%d--Li\n", __func__, on);
	if(on) {
	
	#if defined(MT6575) || defined(MT6577)
		hwPowerOn(MT65XX_POWER_LDO_VGP, VOL_1800, "touch"); 
	#else
		mt_set_gpio_mode(GPIO_CTP_EN_PIN, GPIO_CTP_EN_PIN_M_GPIO);
		mt_set_gpio_dir(GPIO_CTP_EN_PIN, GPIO_DIR_OUT);
		mt_set_gpio_out(GPIO_CTP_EN_PIN, GPIO_OUT_ONE);
	#endif 
		msleep(10);
		mt_set_gpio_mode(GPIO_CTP_RST_PIN, GPIO_CTP_RST_PIN_M_GPIO);
		mt_set_gpio_dir(GPIO_CTP_RST_PIN, GPIO_DIR_OUT); 
		mt_set_gpio_out(GPIO_CTP_RST_PIN, GPIO_OUT_ONE);
		udelay(300);
		mt_set_gpio_out(GPIO_CTP_RST_PIN, GPIO_OUT_ZERO);  
		msleep(30);
		mt_set_gpio_mode(GPIO_CTP_EINT_PIN, GPIO_CTP_EINT_PIN_M_EINT);
		mt_set_gpio_dir(GPIO_CTP_EINT_PIN, GPIO_DIR_IN);
		mt_set_gpio_pull_enable(GPIO_CTP_EINT_PIN, GPIO_PULL_ENABLE);
		mt_set_gpio_pull_select(GPIO_CTP_EINT_PIN, GPIO_PULL_UP);
	}
	else {
	#if defined(MT6575) || defined(MT6577)
		hwPowerDown(MT65XX_POWER_LDO_VGP, "touch"); 
	#else
		mt_set_gpio_mode(GPIO_CTP_EN_PIN, GPIO_CTP_EN_PIN_M_GPIO);
		mt_set_gpio_dir(GPIO_CTP_EN_PIN, GPIO_DIR_IN);
		mt_set_gpio_out(GPIO_CTP_EN_PIN, GPIO_OUT_ZERO);
	#endif
		mt_set_gpio_mode(GPIO_CTP_RST_PIN, GPIO_CTP_RST_PIN_M_GPIO);
		mt_set_gpio_dir(GPIO_CTP_RST_PIN, GPIO_DIR_IN);
		mt_set_gpio_out(GPIO_CTP_RST_PIN, GPIO_OUT_ZERO);  
		mt_set_gpio_mode(GPIO_CTP_EINT_PIN, GPIO_CTP_EINT_PIN_M_GPIO);
		mt_set_gpio_dir(GPIO_CTP_EINT_PIN, GPIO_DIR_OUT);
		mt_set_gpio_out(GPIO_CTP_EINT_PIN, GPIO_OUT_ZERO);
	}
	mt6575_touch_info("-%s: on=%d--Li\n", __func__, on);
}

