jomadmann/tinno77_s7505_kk_beta1/mediatek/custom/common/kernel/touchpanel/cy8ctst242/cy8ctst242.c
static void cy8ctst_i2c_gpio(void) 
{
    mt_set_gpio_mode(GPIO_CTP_RST_PIN, GPIO_CTP_RST_PIN_M_GPIO);
    mt_set_gpio_mode(GPIO_I2C0_SCA_PIN, GPIO_I2C0_SCA_PIN_M_GPIO);
    mt_set_gpio_mode(GPIO_I2C0_SDA_PIN, GPIO_I2C0_SDA_PIN_M_GPIO);
    mt_set_gpio_dir(GPIO_CTP_RST_PIN, GPIO_DIR_OUT);
    mt_set_gpio_dir(GPIO_I2C0_SCA_PIN, GPIO_DIR_OUT);
    mt_set_gpio_dir(GPIO_I2C0_SDA_PIN, GPIO_DIR_OUT);

    mt_set_gpio_pull_enable(GPIO_CTP_RST_PIN, GPIO_PULL_ENABLE);
    mt_set_gpio_pull_select(GPIO_CTP_RST_PIN, GPIO_PULL_UP);
    mt_set_gpio_pull_enable(GPIO_I2C0_SCA_PIN, GPIO_PULL_ENABLE);
    mt_set_gpio_pull_select(GPIO_I2C0_SCA_PIN, GPIO_PULL_UP);
    mt_set_gpio_pull_enable(GPIO_I2C0_SDA_PIN, GPIO_PULL_ENABLE);
    mt_set_gpio_pull_select(GPIO_I2C0_SDA_PIN, GPIO_PULL_UP);

    mt_set_gpio_out(GPIO_CTP_RST_PIN, GPIO_OUT_ONE);
    mt_set_gpio_out(GPIO_I2C0_SCA_PIN, GPIO_OUT_ZERO);
    mt_set_gpio_out(GPIO_I2C0_SDA_PIN, GPIO_OUT_ZERO); 
}

static void cy8ctst_gpio_i2c(void) 
{
    mt_set_gpio_mode(GPIO_I2C0_SCA_PIN, GPIO_I2C0_SCA_PIN_M_SCL);
    mt_set_gpio_mode(GPIO_I2C0_SDA_PIN, GPIO_I2C0_SDA_PIN_M_SDA);
}

void cy8ctst_reset(void)
{
	mt6575_touch_info("%s:--Li\n", __func__);
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	mutex_lock(&cy8ctst_client->power_lock);
	mt_eint_mask(CUST_EINT_TOUCH_PANEL_NUM);
	cy8ctst_power(0);
	cy8ctst_i2c_gpio();
	msleep(10);  
	cy8ctst_power(1);
	cy8ctst_gpio_i2c();
	msleep(150);  
	mt_eint_unmask(CUST_EINT_TOUCH_PANEL_NUM);
	mutex_unlock(&cy8ctst_client->power_lock);
}

int cy8ctst_read_reg(uint8_t reg, uint8_t *value)
{
	int ret = 0, iRetry = 5;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	if(cy8ctst_client->client) {
		mutex_lock(&cy8ctst_client->lock);
		while (iRetry) {
			ret = i2c_smbus_read_i2c_block_data(cy8ctst_client->client, reg, 1, value);
			if(ret < 0) {
				--iRetry;
				msleep(200);
				continue;
			}
			else {
				mt6575_touch_debug("%s: success, reg=0x%02x, value=0x%02x, iRetry=%d--Li\n", 
					__func__, reg, *value, iRetry);
				break;
			}	
		}
		if(!iRetry && (ret < 0)) {
			mt6575_touch_info("%s: error, ret=%d--Li\n", 
					__func__, ret);
			mutex_unlock(&cy8ctst_client->lock);
			return -1;
		}
		mutex_unlock(&cy8ctst_client->lock);
	}
	else {
		mt6575_touch_info("%s: cy8ctst_client->client is NULL--Li\n", __func__);
		return -1;
	}
	return ret;
	
}

int cy8ctst_read_reg_ext(u8 addr, unsigned char *pdata)
{
	int rc;
	unsigned char buf[2];
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	buf[0] = addr;     
	mutex_lock(&cy8ctst_client->lock);
	i2c_master_send(cy8ctst_client->client, &buf[0], 1);
	rc = i2c_master_recv(cy8ctst_client->client, &buf[0], 1);
	mutex_unlock(&cy8ctst_client->lock);
	if (rc < 0)
		pr_err("msg %s i2c read error: %d\n", __func__, rc);
	*pdata = buf[0];
	
	return rc;
}

int cy8ctst_write_reg(uint8_t reg, uint8_t *value)
{
	int ret = 0, iRetry = 5;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	if(cy8ctst_client->client) {
		mutex_lock(&cy8ctst_client->lock);
		while (iRetry) {
			ret = i2c_smbus_write_i2c_block_data(cy8ctst_client->client, reg, 1, value);
			if(ret < 0) {
				--iRetry;
				msleep(200);
				continue;
			}
			else {
				mt6575_touch_debug("%s: success, reg=0x%02x, value=0x%02x, iRetry=%d--Li\n", 
					__func__, reg, *value, iRetry);
				break;
			}
		}
		if(!iRetry && (ret < 0)) {
			mt6575_touch_info("%s: error, ret=%d--Li\n", 
					__func__, ret);
			mutex_unlock(&cy8ctst_client->lock);
			return -1;
		}
		mutex_unlock(&cy8ctst_client->lock);
	}
	else {
		mt6575_touch_info("%s: cy8ctst_client->client is NULL--Li\n", __func__);
		return -1;
	}
	return ret;
	
}

int cy8ctst_write_reg_ext(u8 addr, u8 para)
{
	int rc;
	char buf[3];
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	buf[0] = addr;
	buf[1] = para;
	mutex_lock(&cy8ctst_client->lock);
	rc = i2c_master_send(cy8ctst_client->client, buf, 2);
	mutex_unlock(&cy8ctst_client->lock);
	return rc;
}

int cy8ctst_read_block(uint8_t reg, uint8_t *rxbuf, int length)
{
	int i, ret = 0;
	int multiple = length / MAX_READ_BYTE;
	int remainder = length % MAX_READ_BYTE;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	if(length <= 0) {
		mt6575_touch_info("%s: nothing to read--Li\n", __func__);
		return ret;
	}
	mutex_lock(&cy8ctst_client->lock);
	if(multiple > 0) {
		for(i = 0; i < multiple; i ++) {
			ret = i2c_smbus_read_i2c_block_data(cy8ctst_client->client, (reg + i * MAX_READ_BYTE), 
				MAX_READ_BYTE, & (rxbuf[MAX_READ_BYTE * i]));
			if(ret < 0) 
				goto I2C_ERROR;
		}
		if(remainder > 0) {
			ret = i2c_smbus_read_i2c_block_data(cy8ctst_client->client, (reg + i * MAX_READ_BYTE), 
				remainder, & (rxbuf[MAX_READ_BYTE * i]));
			if(ret < 0)
				goto I2C_ERROR;
		}
	}
	else {
		ret = i2c_smbus_read_i2c_block_data(cy8ctst_client->client, reg, 
			remainder, & (rxbuf[0]));
		if(ret < 0) 
			goto I2C_ERROR;
	}
	mutex_unlock(&cy8ctst_client->lock);
	return ret;
	
I2C_ERROR:
	mt6575_touch_info("%s: i2c error, ret=%d--Li\n", __func__, ret);
	mutex_unlock(&cy8ctst_client->lock);
	cy8ctst_reset();
	return ret;
}

#define MAX_I2C_TRANSFER_SIZE 6
int cy8ctst_read_block_ext(uint8_t addr, uint8_t *rxbuf, int len)
{
	u8 retry;
	u16 left = len;
	u16 offset = 0;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	if ( rxbuf == NULL )
		return -1;

	mt6575_touch_info("device 0x%02X address %04X len %d\n", cy8ctst_client->client->addr, addr, len );

	while ( left > 0 ){
		if ( left > MAX_I2C_TRANSFER_SIZE ){
			rxbuf[offset] = ( addr+offset ) & 0xFF;
			cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG | I2C_WR_FLAG | I2C_RS_FLAG;
			retry = 0;
			while ( i2c_master_send(cy8ctst_client->client, &rxbuf[offset], (MAX_I2C_TRANSFER_SIZE << 8 | 1)) < 0 ){
				retry++;

				if ( retry == 5 ){
					cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG;
					mt6575_touch_info("I2C read 0x%X length=%d failed\n", addr + offset, MAX_I2C_TRANSFER_SIZE);
					return -1;
				}
			}
			left -= MAX_I2C_TRANSFER_SIZE;
			offset += MAX_I2C_TRANSFER_SIZE;
		}
		else{
			rxbuf[offset] = ( addr+offset ) & 0xFF;
			cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG | I2C_WR_FLAG | I2C_RS_FLAG;

			retry = 0;
			while ( i2c_master_send(cy8ctst_client->client, &rxbuf[offset], (left << 8 | 1)) < 0 ){
				retry++;

