jomadmann/tinno77_s7505_kk_beta1/mediatek/custom/common/kernel/touchpanel/cy8ctst242/cy8ctst242.c
				if ( retry == 5 ){
					cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG;
					mt6575_touch_info("I2C read 0x%X length=%d failed\n", addr + offset, left);
					return -1;
				}
			}
			offset += left;
			left = 0;
		}
	}
	cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG;
	return 0;
}

int cy8ctst_write_block_simple(uint8_t reg, uint8_t *txbuf, int length)
{
	int i, ret = 0;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	for(i = 0; i < length; i ++) {
		ret = i2c_smbus_write_i2c_block_data(cy8ctst_client->client, reg + i, 1, & (txbuf[i]));
		if (ret)
			goto I2C_ERROR;
	}	
	return ret;
	
I2C_ERROR:
	mt6575_touch_info("%s: i2c error, ret=%d--Li\n", __func__, ret);
	return ret;
}

#if defined(MT6575) || defined(MT6577)
int cy8ctst_write_block(uint8_t *txbuf, int length) 
{
	 /*
	  * Li.Yang
	  * Important here!
	  * the first Byte of txbuf must be the start reg
	  */
	int i, rc = 0;
	 struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	if (length > 0) {
		rc = i2c_master_send(cy8ctst_client->client, (char *)txbuf, length);
		if (rc < 0) {
			mt6575_touch_info("%s:i2c error--Li\n", __func__);
			return -1;
		}
		mt6575_touch_info("%s:success, write_buf=", __func__);
		for(i = 0; i < length; i++) {
			mt6575_touch_info("%02x ", txbuf[i]);
		}
		mt6575_touch_info("--Li\n");
	}
	return rc; 
}
#endif

#if defined(MT6573)
ssize_t cy8ctst_dma_read_block(uint8_t reg, uint8_t *rxbuf, int length)
{
	int rc = 0;
	uint8_t start_addr = reg;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	memset((void *)rxbuf, 0, length);
	mutex_lock(&cy8ctst_client->lock);
	rc = i2c_master_send(cy8ctst_client->client, &start_addr, 1);
	if (rc < 0) {
		mt6575_touch_info("%s:send start addr error--Li\n", __func__);
		mutex_unlock(&cy8ctst_client->lock);
		return rc;
	}

	if (length > 0){
		cy8ctst_client->client->addr = (cy8ctst_client->client->addr & I2C_MASK_FLAG) | I2C_DMA_FLAG;
		rc = i2c_master_recv(cy8ctst_client->client, (char *)cy8ctst_dma_pa, length);
		cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG;
		if (rc < 0) {
			mt6575_touch_info("%s:i2c error--Li\n", __func__);
			mutex_unlock(&cy8ctst_client->lock);
			return rc;
		}
		memcpy((void *)rxbuf, (void *)cy8ctst_dma_va, length);
	}
	mutex_unlock(&cy8ctst_client->lock);
	//mt6575_touch_info("%s:success--Li\n", __func__);
	return 1;
}

int cy8ctst_dma_write_block(u32 pa, int length)
{
	int  i, rc = 0;
	 /*
	  * Li.Yang
	  * Important here!
	  * the first Byte of dma_va must be the start reg
	  */
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	mutex_lock(&cy8ctst_client->lock);
	if (length > 0) {
		cy8ctst_client->client->addr = (cy8ctst_client->client->addr & I2C_MASK_FLAG) | I2C_DMA_FLAG;
		rc = i2c_master_send(cy8ctst_client->client, (char *)pa, length);
		cy8ctst_client->client->addr = cy8ctst_client->client->addr & I2C_MASK_FLAG;
		if (rc < 0) {
			mt6575_touch_info("%s:i2c error--Li\n", __func__);
			mutex_unlock(&cy8ctst_client->lock);
			return -1;
		}
		mt6575_touch_info("%s:success, write_buf=", __func__);
		for(i = 0; i < length; i++) {
			mt6575_touch_info("%02x ", cy8ctst_dma_va[i]);
		}
		mt6575_touch_info("--Li\n");
	}
	mutex_unlock(&cy8ctst_client->lock);
	return 0;
}
#endif

int cy8ctst_data_toggle(void)
{
	int ret = 0;
	mt6575_touch_info("+%s: --Li\n", __func__);
	ret = cy8ctst_read_reg(TPD_REG_BASE, (uint8_t*)&g_operation_data);
	if((g_operation_data.hst_mode & 0x80)==0)
		g_operation_data.hst_mode = g_operation_data.hst_mode|0x80;
	else
		g_operation_data.hst_mode = g_operation_data.hst_mode & (~0x80);
	ret = cy8ctst_write_reg(TPD_REG_BASE, &(g_operation_data.hst_mode));
	mt6575_touch_info("-%s: --Li\n", __func__);
	return ret;
	
}

int cy8ctst_to_zero(void)
{
	int rc = 0;
	uint8_t buf[2];
	buf[0] = 0;
	buf[1] = 0;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	mutex_lock(&cy8ctst_client->lock);
	rc = i2c_master_send(cy8ctst_client->client, buf, 2);
	if (rc < 0) {
		mt6575_touch_info("%s:i2c error--Li\n", __func__);
		mutex_unlock(&cy8ctst_client->lock);
		return -1;
	}
	mt6575_touch_info("%s:success--Li\n", __func__);
	mutex_unlock(&cy8ctst_client->lock);
	return rc; 
	
}

int cy8ctst_bootloader_info (int show)
{
	int ret = TPD_OK;
	ret = cy8ctst_read_block(TPD_REG_BASE, (uint8_t *)&g_bootloader_data, sizeof(g_bootloader_data));
	if(show)
	mt6575_touch_info("BootLoader: bl_file=%02X, bl_status=%02X, bl_error=%02X\n", 
		g_bootloader_data.bl_file, g_bootloader_data.bl_status, g_bootloader_data.bl_error);

	mt6575_touch_info("BootLoader: blver=%02X%02X, bld_blver=%02X%02X\n", 
		g_bootloader_data.blver_hi, g_bootloader_data.blver_lo, 
		g_bootloader_data.bld_blver_hi, g_bootloader_data.bld_blver_lo);

	mt6575_touch_info("BootLoader: ttspver=0x%02X%02X, appid=0x%02X%02X, appver=0x%02X%02X\n", 
		g_bootloader_data.ttspver_hi, g_bootloader_data.ttspver_lo, 
		g_bootloader_data.appid_hi, g_bootloader_data.appid_lo, 
		g_bootloader_data.appver_hi, g_bootloader_data.appver_lo);
	 
	mt6575_touch_info("BootLoader: cid=0x%02X%02X%02X\n", 
		g_bootloader_data.cid_0, g_bootloader_data.cid_1, 
		g_bootloader_data.cid_2);
	return ret;
 }

void cy8ctst_exit_bootloader(void)
{
	int cmd_length = sizeof(bootloader_exit_cmd);
	mt6575_touch_info("%s--Li\n", __func__);
#if defined(MT6575) || defined(MT6577)
	cy8ctst_write_block(bootloader_exit_cmd, cmd_length);
#else
	memcpy((void *)cy8ctst_dma_va, (void *)bootloader_exit_cmd, cmd_length);
	cy8ctst_dma_write_block(cy8ctst_dma_pa, cmd_length);
#endif
	mdelay(10);
}

int cy8ctst_swtich_mode(uint8_t mode)
{
	int ret;
	ret = cy8ctst_write_reg(TPD_REG_BASE, &mode);
	return ret;
}

/*int e()
{
	uint8_t vendor, fw;
	int ret = 0;
	ret = cy8ctst_read_reg(CY8CTST_VENDOR_REG, &vendor);
	if(ret < 0) {
		mt6575_touch_info("%s: get vendor error--Li\n", __func__);
		return -1;
	}
	ret = cy8ctst_read_reg(CY8CTST_FW_REG, &fw);
	if(ret < 0) {
		mt6575_touch_info("%s: get fw version error--Li\n", __func__);
		return -1;
	}
	mt6575_touch_info("%s: OP mode, vendor=0x%02x, fw=0x%02x--Li\n", 
		__func__, vendor, fw);
	return ret;
}*/
int cy8ctst_get_vendor_fw()
{
	uint8_t vendor, fw;
	int ret = 0;
	ret = cy8ctst_read_reg(CY8CTST_VENDOR_REG, &vendor);
	if(ret < 0) {
		mt6575_touch_info("%s: get vendor error--Liu\n", __func__);
		return -1;
	}
	ret = cy8ctst_read_reg(CY8CTST_FW_REG, &fw);
	if(ret < 0) {
		mt6575_touch_info("%s: get fw version error--Liu\n", __func__);
		return -1;
	}
	mt6575_touch_info("%s: OP mode, vendor=0x%02x, fw=0x%02x--Liu\n", 
		__func__, vendor, fw);
	return ret;
}
int cy8ctst_get_fw()
{
	uint8_t fw =-1;
	int ret = 0;
	ret = cy8ctst_read_reg(CY8CTST_FW_REG, &fw);
	if(ret < 0) {
		mt6575_touch_info("%s: get fw version error--Li\n", __func__);
		return -1;
	}
	return (int)fw;
}
EXPORT_SYMBOL(cy8ctst_get_fw);
#ifdef CY8CTST242_USE_ALLOC_MEM
int cy8ctst_mem_alloc(void)
{
	i2c_bin_buf = (uint8_t *)kzalloc(I2C_BIN_SIZE, GFP_KERNEL);
	if(!i2c_bin_buf) {
		mt6575_touch_info("%s: NO MEM for i2c_bin_buf--Li\n", __func__);
		return -ENOMEM;
	}
	i2c_cmd_list = (struct cy8ctst_i2c_cmd *)kzalloc(sizeof(struct cy8ctst_i2c_cmd) * 50 * 1024, GFP_KERNEL);
	if(!i2c_cmd_list) {
		mt6575_touch_info("%s: NO MEM for i2c_cmd_list--Li\n", __func__);
		return -ENOMEM;
	}
	return 0;
}


int cy8ctst_mem_free(void)
{
	kfree(i2c_bin_buf);
	kfree(i2c_cmd_list);
	i2c_bin_buf = NULL;
	i2c_cmd_list = NULL;
	return 0;
}
EXPORT_SYMBOL(cy8ctst_mem_free);
#endif
bool cy8ctst_msg2133(void)
{
	return g_bcy8stmstar ;
}
EXPORT_SYMBOL(cy8ctst_msg2133);
int cy8ctst_dump_cmd_list(int num)
{
	int i, j;
	mt6575_touch_info("+%s:--Li\n", __func__);
	for(i = 0; i < num; i ++) {
		mt6575_touch_info("%s: opration=%d, addr=0x%02x, cmd_length=%d, delay_time=%d, cmd_buf=", 
			__func__, i2c_cmd_list[i].opration, i2c_cmd_list[i].addr, 
			i2c_cmd_list[i].cmd_length, i2c_cmd_list[i].delay_time);
		for(j = 0; j < 20; j++) {
			mt6575_touch_info("%02x ", i2c_cmd_list[i].cmd_buf[j]);
		}
		mt6575_touch_info("\n");
	}
	mt6575_touch_info("-%s:--Li\n", __func__);
	return 0;
}
EXPORT_SYMBOL(cy8ctst_dump_cmd_list);

int cy8ctst_read_i2c_bin(const char *filename)
{
	int length, ret, num = 0;
	struct file	*filp = NULL;
	char *start;
	uint8_t *tmp;
	uint32_t pos = 0;
	filp = filp_open(filename, O_RDONLY, 0);
	if (IS_ERR(filp) ||  !filp) {
		mt6575_touch_info("%s: unable to open i2c bin--Li\n", __func__);
		return PTR_ERR(filp);
	}
#ifdef CY8CTST242_USE_ALLOC_MEM
	ret = cy8ctst_mem_alloc();
	if(ret) {
		return -1;
	}
#endif
	length = kernel_read(filp, filp->f_pos, i2c_bin_buf, I2C_BIN_SIZE);
	mt6575_touch_info("%s: read i2c bin file success, length=%d--Li\n", __func__, length);
	if(length >= I2C_BIN_SIZE) {
		mt6575_touch_info("%s:i2c bin to large, length=%d--Li\n", __func__, length);
		//return -1;
	}
	tmp = i2c_bin_buf;
	process_cmd = 1;
	while(tmp) {
		tmp = strstr(&i2c_bin_buf[pos], "\r\n");
		if(!tmp) {
			mt6575_touch_info("%s: reach the end of  i2c bin file--Li\n", __func__);
			break;
		}
		else {
			if((*(tmp-1) != 'p' ) && (*(tmp-1) =!']')) {
				mt6575_touch_info("%s: unknow command--Li\n", __func__);
				continue;
			}
		}
		i2c_cmd_list[num].cmd_length = 0;
		start = &i2c_bin_buf[pos];
		//mt6575_touch_info("start=0x%02x, 0x%02x, 0x%02x, 0x%02x, ...\n", 
			//*start, *(start + 1), *(start + 2), *(start + 3));
		switch(*start) {
			case 'w':
				i2c_cmd_list[num].opration = I2C_WRITE_CMD;
				memset(i2c_cmd_list[num].cmd_buf, -1, sizeof(i2c_cmd_list[num].cmd_buf));
				++start;
				while(*start == ' ')
					++start;
				i2c_cmd_list[num].addr = (uint8_t)simple_strtoul(start, &start, 16);
				while(*start == ' ')
					++start;
				i2c_cmd_list[num].reg= (uint8_t)simple_strtoul(start, &start, 16);
				while(*(start + 1) != 'p') {
					++start;
					if(*start == ' ') 
						continue;
					i2c_cmd_list[num].cmd_buf[i2c_cmd_list[num].cmd_length++] = 
						(uint8_t)simple_strtoul(start, &start, 16);
				}
				//mt6575_touch_info("opration=%d, addr=0x%02x, reg=0x%02x, cmd_length=%d\n", 
					//i2c_cmd_list[num].opration, i2c_cmd_list[num].addr, 
					//i2c_cmd_list[num].reg, i2c_cmd_list[num].cmd_length);
				break;
			case 'r':
				i2c_cmd_list[num].opration = I2C_READ_CMD;
				memset(i2c_cmd_list[num].cmd_buf, -1, sizeof(i2c_cmd_list[num].cmd_buf));
				++start;
				while(*start == ' ')
					++start;
				i2c_cmd_list[num].addr =  (uint8_t)simple_strtoul(start, &start, 16);
				break;
			case '[':
				i2c_cmd_list[num].opration = I2C_DELAY_CMD;
				memset(i2c_cmd_list[num].cmd_buf, -1, sizeof(i2c_cmd_list[num].cmd_buf));
				while(*start != '=')
					++start;
				++start;
				i2c_cmd_list[num].delay_time = (int)simple_strtoul(start, &start, 10);
				break;
			default:
				i2c_cmd_list[num].opration = I2C_UNKNOW_CMD;
				break;
		}
		
		pos = tmp -i2c_bin_buf + 2;
		num ++;	
	}
	total_cmd_num = num;
	process_cmd = 0;
	cy8ctst_dump_cmd_list(total_cmd_num);
	return 0;
}
EXPORT_SYMBOL(cy8ctst_read_i2c_bin);

int cy8ctst_update(void)
{
	int i, iLoop, iCheck = 0;
	int blk_num = 0, ret = 0;
	uint8_t buf[2];
	if(!i2c_cmd_list || !total_cmd_num) {
		mt6575_touch_info("%s: i2c_cmd_list=%p, total_cmd_num=%d--Li\n", 
			__func__, i2c_cmd_list, total_cmd_num);
		return -1;
	}
	mt6575_touch_info("%s: start--Li\n", __func__);
	cy8ctst_bootloader_info(1);
	process_cmd = 1;
	for (i = 0; i < total_cmd_num; i++) {
		switch(i2c_cmd_list[i].opration) {
			case I2C_WRITE_CMD:
				if( i2c_cmd_list[i].cmd_length > 1) {
					iLoop = 0;
					while(iLoop < 10) {
					#if defined(MT6575) || defined(MT6577)
						ret = cy8ctst_write_block(i2c_cmd_list[i].cmd_buf, i2c_cmd_list[i].cmd_length);
					#else
						memcpy((void *)cy8ctst_dma_va, (void*)i2c_cmd_list[i].cmd_buf, 
							i2c_cmd_list[i].cmd_length);
						ret = cy8ctst_dma_write_block(cy8ctst_dma_pa, i2c_cmd_list[i].cmd_length);
					#endif
						if(ret >= 0) {
							break;
						}
						else {
							mt6575_touch_info("%s: i2c error, i=%d, iLoop=%d--Li\n", 
								__func__, i, iLoop);
							++iLoop;
							msleep(50);
							continue;
						}
					}
					if(iLoop == 10) {
						mt6575_touch_info("%s: error, i=%d--Li\n", __func__, i);
						return -1;
					}
				}
				break;
			case I2C_READ_CMD:
				if(iCheck > 10) {
					mt6575_touch_info("%s: too many times checking, i=%d--Li\n", 
							__func__, i);
					return -1;
				}
				cy8ctst_read_block(TPD_REG_BASE, buf, 3);
				if(buf[2] == 0x20) {
					//write a block OK
					++blk_num;
					mt6575_touch_info("%s: write %d blocks, i=%d--Li\n", 
							__func__, blk_num, i);
					iCheck = 0;
				}
				else {
					++iCheck;
					mt6575_touch_info("%s: write a block error, i=%d, iCheck=%d, buf[2]=0x%02x--Li\n", 
							__func__, i, iCheck, buf[2]);
					if(i > 8)
						i -= 8;
				}
				break;	
			case I2C_DELAY_CMD:
				msleep(i2c_cmd_list[i].delay_time);
				#if 0
				switch(i2c_cmd_list[i].delay_time) 
				{
					case 100:
						msleep(i2c_cmd_list[i].delay_time/2);
						break;
					case 12000:
						msleep(8000);
						break;
					default:
						msleep(i2c_cmd_list[i].delay_time);
						break;
				}
				#endif
					
				break;
			case I2C_UNKNOW_CMD:
				mt6575_touch_info("%s: unknow cmd, i=%d--Li\n", 
					__func__, i);
				break;
			default:
				break;
		}
	}
	process_cmd = 0;
	cy8ctst_exit_bootloader();
	cy8ctst_get_vendor_fw();
	return 0;
}
EXPORT_SYMBOL(cy8ctst_update);

int cy8ctst_get_blk_data(void)
{
	int i = 0, j = 0, l = 0, k = -1;
	for(i = 0; i < total_cmd_num; i++) {
		if((i2c_cmd_list[i].opration == I2C_WRITE_CMD) && (i2c_cmd_list[i].cmd_length > 1)) {
			if((i2c_cmd_list[i].cmd_buf[0] == 0x00) && 
				(i2c_cmd_list[i].cmd_buf[1] == 0xFF)) {
				++k; j = 0;
				blk_list[k].blk_length= 0;	
			}
			if(j < 5) {
				mt6575_touch_info("%s: k=%d, j=%d", __func__, k, j);
				for(l = 0; l < i2c_cmd_list[i].cmd_length; l++) {
					mt6575_touch_info(" %02x", i2c_cmd_list[i].cmd_buf[l]);
				}
				mt6575_touch_info("--Li\n");
				memcpy((void *)&(blk_list[k].blk_buf[16 * j]), (void *)&(i2c_cmd_list[i].cmd_buf[1]), 
					(i2c_cmd_list[i].cmd_length-1));
				blk_list[k].blk_length +=  (i2c_cmd_list[i].cmd_length -1);
				++j;
			}
		}
	}
	total_blk_num = k + 1;
	return 0;
}
EXPORT_SYMBOL(cy8ctst_get_blk_data);

