jomadmann/tinno77_s7505_kk_beta1/mediatek/custom/common/kernel/touchpanel/cy8ctst242/cy8ctst242.c
int cy8ctst_dump_blk_info(void)
{
	int i, j;
	mt6575_touch_info("+%s: total_blk_num=%d--Li\n", __func__, total_blk_num);
	for(i = 0; i < total_blk_num; i++) {
		mt6575_touch_info("%s: %d block, blk_length=%d, blk_buf=", 
			__func__, i, blk_list[i].blk_length);
		for(j = 0; j < blk_list[i].blk_length; j++) {
			mt6575_touch_info("%02x ", blk_list[i].blk_buf[j]);
		}
		mt6575_touch_info("\n");
	}
	mt6575_touch_info("-%s:--Li\n", __func__);
}
EXPORT_SYMBOL(cy8ctst_dump_blk_info);

int cy8ctst_block_update(void)
{
	int i, ret = 0;
	uint8_t buf[100], check_buf[3];
	uint8_t reg = TPD_REG_BASE;
	buf[0] = 0x00;
	struct i2c_client_ctxt *cy8ctst_client = _cy8ctst_client;
	if(!i2c_cmd_list || !blk_list) {
		mt6575_touch_info("%s: i2c_cmd_list or blk_list is NULL--Li\n", __func__);
	}
	cy8ctst_reset();
	memcpy((void *)&buf[1], i2c_cmd_list[0].cmd_buf, i2c_cmd_list[0].cmd_length);
#if defined(MT6575) || defined(MT6577)
	//Set command to set Touch in download mode
	ret = cy8ctst_write_block(buf, (i2c_cmd_list[0].cmd_length + 1));
	msleep(8000);
	//Set the reg to base
	i2c_master_send(cy8ctst_client->client, (char *)&reg, 1);
	cy8ctst_read_block(TPD_REG_BASE, check_buf, 3);
	if(check_buf[2] != 0x20) {
		mt6575_touch_info("%s: check_buf[2]=0x%02x, check error for download cmd--Li\n", 
			__func__, check_buf[2]);
	}
	for(i = 0; i < total_blk_num; i++) {
		//Block size should be 78 Byte
		if(blk_list[i].blk_length > 16) {
			memcpy((void *)&buf[1], blk_list[i].blk_buf, blk_list[i].blk_length);
			ret = cy8ctst_write_block(buf, (blk_list[i].blk_length + 1));
		}
		msleep(50);
		//Set the reg to base
		i2c_master_send(cy8ctst_client->client, (char *)&reg, 1);
		//Check whether the write cmd is OK
		cy8ctst_read_block(TPD_REG_BASE, check_buf, 3);
		if(check_buf[2] != 0x20) {
			
			mt6575_touch_info("%s: check error for %d blocks write--Li\n", __func__, i);
		}
		else {
			mt6575_touch_info("%s: wrtie %d blocks(total %d)--Li\n", 
				__func__, i, total_blk_num);
		}
	}	
#else
	memcpy((void *)cy8ctst_dma_va, (void *)buf, i2c_cmd_list[0].cmd_length + 1);
	//Set command to set Touch in download mode
	ret = cy8ctst_dma_write_block(cy8ctst_dma_pa, i2c_cmd_list[0].cmd_length + 1);
	msleep(8000);
	//Set the reg to base
	i2c_master_send(cy8ctst_client->client, (char *)&reg, 1);
	cy8ctst_read_block(TPD_REG_BASE, check_buf, 3);
	if(check_buf[2] != 0x20) {
		mt6575_touch_info("%s: check error for download cmd--Li\n", __func__);
	}
	for(i = 0; i < total_blk_num; i++) {
		//Block size should be 78 Byte
		if(blk_list[i].blk_length > 16) {
			memcpy((void *)&buf[1], blk_list[i].blk_buf, blk_list[i].blk_length);
			memcpy((void *)cy8ctst_dma_va, (void *)buf, blk_list[i].blk_length + 1);
			ret = cy8ctst_dma_write_block(cy8ctst_dma_pa, blk_list[i].blk_length + 1);
		}
		msleep(50);
		//Set the reg to base
		i2c_master_send(cy8ctst_client->client, (char *)&reg, 1);
		//Check whether the write cmd is OK
		cy8ctst_read_block(TPD_REG_BASE, buf, 3);
		if(buf[2] != 0x20) {
			mt6575_touch_info("%s: check error for %d blocks write--Li\n", __func__, i);
		}
		else {
			mt6575_touch_info("%s: wrtie %d blocks(total %d)--Li\n", 
				__func__, i, total_blk_num);
		}
	}
#endif
}
EXPORT_SYMBOL(cy8ctst_block_update);

int cy8ctst_open_sersor(int on)
{
	int ret = 0, value = 0;
	mt6575_touch_info("%s:on=%d--Li\n", __func__, on);
	value = !!on;
	sensor_open = value;
	ret = cy8ctst_write_reg(CY8CTST_SENSOR_EN_REG, &value);
	return ret;
}
EXPORT_SYMBOL(cy8ctst_open_sersor);

int cy8ctst_get_sensor_state(void)
{
	int ret = 0, value = 0;
	ret = cy8ctst_read_reg(CY8CTST_SENSOR_STATE_REG, &value);
	mt6575_touch_info("%s:ret=%d, value=%d--Li\n", 
		__func__, ret, value);
	if(ret >= 0) 
		return value;
	else
		return ret;
	
}
EXPORT_SYMBOL(cy8ctst_get_sensor_state);

int cy8ctst_irq_enable(int on)
{
	if(on) {
		mt_eint_unmask(CUST_EINT_TOUCH_PANEL_NUM);
	}
	else {
		mt_eint_mask(CUST_EINT_TOUCH_PANEL_NUM);
	}
	return 0;
}

static void tpd_down(int x, int y, int p) {
#ifdef TPD_HAVE_BUTTON
    if ((boot_mode != NORMAL_BOOT) && (boot_mode != ALARM_BOOT))  {
	    if(y > 320) {
		    tpd_button(x, y, 1);
	    }
    }
#endif
    input_report_abs(tpd->dev, ABS_PRESSURE,p);
    input_report_key(tpd->dev, BTN_TOUCH, 1);
    //input_report_abs(tpd->dev,ABS_MT_TRACKING_ID,i);
    input_report_abs(tpd->dev, ABS_MT_TOUCH_MAJOR, 1);
    input_report_abs(tpd->dev, ABS_MT_POSITION_X, x);
    input_report_abs(tpd->dev, ABS_MT_POSITION_Y, y);
    mt6575_touch_debug("%s: x=%d, y=%d, p=%d--Li\n", __func__, x, y, p);
    input_mt_sync(tpd->dev);
    TPD_DOWN_DEBUG_TRACK(x,y);
}

static void tpd_up(int x, int y,int p) {

    input_report_abs(tpd->dev, ABS_PRESSURE, 0);
    input_report_key(tpd->dev, BTN_TOUCH, 0);
   // input_report_abs(tpd->dev,ABS_MT_TRACKING_ID,i);
    input_report_abs(tpd->dev, ABS_MT_TOUCH_MAJOR, 0);
    input_report_abs(tpd->dev, ABS_MT_POSITION_X, x);
    input_report_abs(tpd->dev, ABS_MT_POSITION_Y, y);
    mt6575_touch_debug("%s: x=%d, y=%d, p=%d--Li\n", 
		__func__, x, y, 0);
    input_mt_sync(tpd->dev);
    TPD_UP_DEBUG_TRACK(x,y);
}

#ifdef CY8CTST_SENSOR
extern void cy8ctst_alsps_do_work(void);
#endif
static int tpd_touchinfo(struct touch_info *cinfo, struct touch_info *pinfo)
{
	u32 retval;
	static uint8_t tt_mode;
	uint8_t data0, data1;
	memcpy(pinfo, cinfo, sizeof(struct touch_info));
	memset(cinfo, 0, sizeof(struct touch_info));
#if defined(MT6575) || defined(MT6577)
	retval = cy8ctst_read_block(TPD_REG_BASE, (uint8_t *)&g_operation_data, 
		sizeof(g_operation_data));
#else
	retval = cy8ctst_dma_read_block(TPD_REG_BASE, (uint8_t *)&g_operation_data, 
		sizeof(g_operation_data));
#endif
	mt6575_touch_debug("hst_mode=%02X, tt_mode=%02X, tt_stat=%02X, sensor_en=%02x, sensor_state=%02x\n", 
		g_operation_data.hst_mode, g_operation_data.tt_mode, g_operation_data.tt_stat, 
		g_operation_data.sensor_en, g_operation_data.sensor_state);
#ifdef CY8CTST_DEBUG
	mt6575_touch_debug("diff_L=%02X, diff_H=%02X, rawdata_L=%02X, rawdata_H=%02x, baseline_L=%02x, baseline_H=%02x,\n", 
		g_operation_data.diff_L, g_operation_data.diff_H, g_operation_data.rawdata_L, 
		g_operation_data.rawdata_H, g_operation_data.baseline_L, g_operation_data.baseline_H);
#endif
#ifdef CY8CTST_SENSOR
	if(g_operation_data.sensor_en) {
		cy8ctst_alsps_do_work();
	}
#endif
	cinfo->count = (g_operation_data.tt_stat & 0x0f) ; //point count
	mt6575_touch_debug("cinfo->count =%d\n",cinfo->count);
	mt6575_touch_debug("Procss raw data...\n");

	cinfo->x1 = (( g_operation_data.x1_H << 8) | ( g_operation_data.x1_L)); //point 1		
	cinfo->y1  = (( g_operation_data.y1_H << 8) | ( g_operation_data.y1_L));
	cinfo->p1 = g_operation_data.z1;
	cinfo->id1 = ((g_operation_data.touch12_id & 0xf0) >>4) -1;
	mt6575_touch_debug("cinfo->x1=%3d, cinfo->y1=%3d, cinfo->p1=%3d\n", 
		cinfo->x1 ,cinfo->y1 ,cinfo->p1);

	if(cinfo->count >1) {
		cinfo->x2 = (( g_operation_data.x2_H << 8) | ( g_operation_data.x2_L)); //point 2
		cinfo->y2 = (( g_operation_data.y2_H << 8) | ( g_operation_data.y2_L));
		cinfo->p2 = g_operation_data.z2;
		cinfo->id2 = (g_operation_data.touch12_id & 0x0f)-1;
		mt6575_touch_debug("cinfo->x2=%3d, cinfo->y2=%3d, cinfo->p2=%3d\n", 
			cinfo->x2, cinfo->y2, cinfo->p2);	
	}

	if (!cinfo->count) 
		return true; // this is a touch-up event

	if (g_operation_data.tt_mode & 0x20) {
		// buffer is not ready for use
		mt6575_touch_debug("uffer is not ready for use!\n");
		memcpy(cinfo, pinfo, sizeof(struct touch_info));
		return false;
	}

	// data toggle 
	data0 = cy8ctst_read_reg(TPD_REG_BASE, (uint8_t*)&g_operation_data);
	if((g_operation_data.hst_mode & 0x80)==0)
		g_operation_data.hst_mode = g_operation_data.hst_mode|0x80;
	else
		g_operation_data.hst_mode = g_operation_data.hst_mode & (~0x80);
	data1 = cy8ctst_write_reg(TPD_REG_BASE, &(g_operation_data.hst_mode));

	if (tt_mode == g_operation_data.tt_mode) {
 		// sampling not completed
            mt6575_touch_debug("sampling not completed!\n");
            memcpy(cinfo, pinfo, sizeof(struct touch_info));
            return false; 
	}
	else 
		tt_mode = g_operation_data.tt_mode;

