jomadmann/tinno77_s7505_kk_beta1/mediatek/custom/common/kernel/touchpanel/cy8ctst242/cy8ctst242.c
	return true;

};

static int touch_event_handler(void *unused)
{
	struct touch_info cinfo, pinfo;
	struct sched_param param = { .sched_priority = RTPM_PRIO_TPD };
	sched_setscheduler(current, SCHED_RR, &param);
	do {
		mt_eint_unmask(CUST_EINT_TOUCH_PANEL_NUM);
		set_current_state(TASK_INTERRUPTIBLE); 
		wait_event_interruptible(waiter,tpd_flag!=0);
		tpd_flag = 0;
		set_current_state(TASK_RUNNING);
		if (tpd_touchinfo(&cinfo, &pinfo)) {
			if(cinfo.count > 0) {
				tpd_down(cinfo.x1, cinfo.y1, cinfo.p1);
			if(cinfo.count == 1 && pinfo.count == 2) {
				if (cinfo.id1 == pinfo.id1 && cinfo.id1 != pinfo.id2)
					tpd_up(pinfo.x2, pinfo.y2, pinfo.p2);
				else
					tpd_up(pinfo.x1, pinfo.y1, pinfo.p1);
			}
			if(cinfo.count>1)
				tpd_down(cinfo.x2, cinfo.y2, cinfo.p2);
			}
			else {
			#ifdef TPD_HAVE_BUTTON
				if ((boot_mode != NORMAL_BOOT) && (boot_mode != ALARM_BOOT)) {
					if(cinfo.y1  > 320) 
						tpd_button(cinfo.x1,  cinfo.y1, 0);
				}
			#endif
				if(pinfo.count > 0) {
					tpd_up(pinfo.x1, pinfo.y1, pinfo.p1);
				if(pinfo.count > 1)
					tpd_up(pinfo.x2, pinfo.y2, pinfo.p2);
				}
			}
			input_sync(tpd->dev);
		}
	}while(!kthread_should_stop());
	return 0;
}

static int tpd_detect(struct i2c_client *client, int kind, struct i2c_board_info *info)
{
    strcpy(info->type, "mtk-tpd");
    return 0;
}

static void tpd_eint_interrupt_handler(void)
{
    mt6575_touch_debug("TPD interrupt has been triggered\n");
    tpd_flag = 1;
    wake_up_interruptible(&waiter);
}

extern int cy8ctst_issp_init(void);
static int __devinit tpd_probe(struct i2c_client *client, const struct i2c_device_id *id)
{	 
	mt6575_touch_info("======================%s: -Li==========\n", __func__);
	int i, ret = TPD_OK;
	int retry = 5;
	char buffer[2], rxbuf[11];
	struct i2c_client_ctxt *cy8ctst_client;
	cy8ctst_client = kzalloc(sizeof(*cy8ctst_client), GFP_KERNEL);
	if (!cy8ctst_client) {
		mt6575_touch_info("%s: no memery!--Li\n", __func__);
		return -ENOMEM;
	}
	cy8ctst_client->client = client;
	mutex_init(&cy8ctst_client->lock);
	mutex_init(&cy8ctst_client->power_lock);
	_cy8ctst_client = cy8ctst_client;
	if(!binit) {
		binit = 1;
		cy8ctst_issp_init();
	}
	cy8ctst_power(1);
	msleep(100);
	while (retry) {
		ret = cy8ctst_read_reg(TPD_REG_BASE, &(buffer[0]));
		if(ret < 0) {
			mt6575_touch_info("%s: ret=%d, retry=%d--Li\n", __func__, ret, retry);
			msleep(100);
			--retry;
		}
		else {
			mt6575_touch_info("%s: success retry=%d--Li\n", __func__, retry);
			break;
		}

	}
	if(!retry) {
		g_bcy8stmstar = false;
		mt6575_touch_info("%s: i2c error, stop probe here!--Li\n", __func__);
		cy8ctst_client->client= NULL;
		mt_eint_mask(CUST_EINT_TOUCH_PANEL_NUM);
		cy8ctst_power(0);
		return ret;
	}
#if defined(MT6573)
	cy8ctst_dma_va = (uint8_t *)dma_alloc_coherent(NULL, 4096, &cy8ctst_dma_pa, GFP_KERNEL);
	if(!cy8ctst_dma_va) {
		mt6575_touch_info("%s: Allocate DMA I2C Buffer failed!--Li\n", __func__);
		return -1;
	}
#endif
#ifdef CY8CTST_BOOTLOADER
	cy8ctst_swtich_mode(TPD_SOFT_RESET_MODE);
	retry = 10;
	while(retry) {
		mdelay(100);
		ret = cy8ctst_bootloader_info(1);
		if(ret < 0) {
			mt6575_touch_info("%s: get bootloader_info i2c error!--Li\n", __func__);
			break;
		}
		else {
			if(GET_BOOTLOADERMODE(g_bootloader_data.bl_status))  {
				mt6575_touch_info("%s: break, get bootloader mode, bl_status=0x%x, bl_file=0x%x, retry=%d--Li\n", 
					__func__, g_bootloader_data.bl_status, g_bootloader_data.bl_file, retry);
				break;
			}
			else {
				if(g_bootloader_data.bl_file == TPD_LOW_PWR_MODE) {
					mt6575_touch_info("%s: break, get LOW_PWR_MODE mode, bl_status=0x%x, bl_file=0x%x, retry=%d--Li\n", 
						__func__, g_bootloader_data.bl_status, g_bootloader_data.bl_file, retry);
					break;
				}
				else {
					--retry;
				}
					
			}
		}
	}
	
	cy8ctst_read_block(TPD_REG_BASE, rxbuf, 16);
	mt6575_touch_info("rxbuf before exit_bootloader");

	for(i = 0; i < 12; i++) {
		mt6575_touch_info(" %02x", rxbuf[i]);		
	}
	mt6575_touch_info("--Li\n");
	cy8ctst_exit_bootloader();
	cy8ctst_read_block(TPD_REG_BASE, rxbuf, 16);
	mt6575_touch_info("rxbuf after exit_bootloader");		
	for(i = 0; i < 12; i++) {
		mt6575_touch_info(" %02x", rxbuf[i]);		
	}
	mt6575_touch_info("--Li\n");
#endif
	tpd_load_status = 1;
	thread = kthread_run(touch_event_handler, 0, TPD_DEVICE);
	if (IS_ERR(thread)) { 
		ret = PTR_ERR(thread);
		return ret;
		mt6575_touch_info(TPD_DEVICE " failed to create kernel thread: %d\n", ret);
	}
	mt_eint_set_sens(CUST_EINT_TOUCH_PANEL_NUM,CUST_EINT_EDGE_SENSITIVE);//CUST_EINT_LEVEL_SENSITIVE
	mt_eint_set_polarity(CUST_EINT_TOUCH_PANEL_NUM, CUST_EINT_TOUCH_PANEL_POLARITY);
	mt_eint_set_hw_debounce(CUST_EINT_TOUCH_PANEL_NUM, CUST_EINT_TOUCH_PANEL_DEBOUNCE_CN);
	mt_eint_registration(CUST_EINT_TOUCH_PANEL_NUM, CUST_EINT_TOUCH_PANEL_TYPE, tpd_eint_interrupt_handler, 1);
	mt_eint_unmask(CUST_EINT_TOUCH_PANEL_NUM);
	msleep(100);
	mt6575_touch_info("CY8CTST242 Touch Panel Device Probe %s--Li\n", 
		(ret < TPD_OK) ? "FAIL" : "PASS");
	return ret;
}

static int __devexit tpd_remove(struct i2c_client *client)
{
#ifdef CONFIG_HAS_EARLYSUSPEND
	unregister_early_suspend(&early_suspend);
#endif /* CONFIG_HAS_EARLYSUSPEND */
	mt6575_touch_info("TPD removed\n");
	return 0;
}

static int tpd_local_init(void)
{
	mt6575_touch_info("CY8CTST242 I2C Touchscreen Driver (Built %s @ %s)--Li\n", 
		__DATE__, __TIME__);
	if(i2c_add_driver(&tpd_i2c_driver)!=0) {
		TPD_DMESG("unable to add i2c driver.\n");
		return -1;
	}

	if(tpd_load_status == 0){
		mt6575_touch_info("add error touch panel driver.\n");
		i2c_del_driver(&tpd_i2c_driver);
		return -1;
	}

#ifdef TPD_HAVE_BUTTON
	tpd_button_setting(TPD_KEY_COUNT, 
		tpd_keys_local, tpd_keys_dim_local);
	boot_mode = get_boot_mode();
#endif
	return 0;
}

static void tpd_resume(struct early_suspend *h)
{
	mt6575_touch_info("+%s:--Li\n", __func__);
	if(process_cmd || updating || sensor_open) {
		mt6575_touch_info("%s: process_cmd=%d, updating=%d, sensor_open=%d--Li\n", 
			__func__, process_cmd, updating, sensor_open);
		return;
	}
	cy8ctst_power(1);
#ifdef CY8CTST_BOOTLOADER
	cy8ctst_exit_bootloader();
#endif
	//Avoid useless interrupt after touch power on
	msleep(150);
	mt_eint_unmask(CUST_EINT_TOUCH_PANEL_NUM);  
	mt6575_touch_info("-%s:--Li\n", __func__);
    mt6575_touch_info("=======cy8ctst_get_fw()=====%d",cy8ctst_get_fw());
}

static void tpd_suspend(struct early_suspend *h)
{
	mt6575_touch_info("+%s:--Li\n", __func__);
	if(process_cmd || updating || sensor_open) {
		mt6575_touch_info("%s: process_cmd=%d, updating=%d, sensor_open=%d--Li\n", 
			__func__, process_cmd, updating, sensor_open);
		return;
	}
	mt_eint_mask(CUST_EINT_TOUCH_PANEL_NUM);
	cy8ctst_power(0);
	mt6575_touch_info("-%s:--Li\n", __func__);
}

static struct tpd_driver_t tpd_device_driver = {
    .tpd_device_name = "cy8ctst242",
    .tpd_local_init = tpd_local_init,
    .suspend = tpd_suspend,
    .resume = tpd_resume,
#ifdef TPD_HAVE_BUTTON
    .tpd_have_button = 1,
#else
    .tpd_have_button = 0,
#endif		
};

static int __init tpd_driver_init(void) {
	mt6575_touch_info("Tinno cy8ctst242 touch panel driver init\n");
        i2c_register_board_info(TPD_I2C_GROUP_ID, &cy8ctst242_i2c_tpd, sizeof(cy8ctst242_i2c_tpd)/sizeof(cy8ctst242_i2c_tpd[0]));
	if(tpd_driver_add(&tpd_device_driver) < 0)
		mt6575_touch_info("Add cy8ctst242 driver failed\n");
	return 0;
}

static void __exit tpd_driver_exit(void) {
	mt6575_touch_info("Tinno cy8ctst242 touch panel driver exit\n");
	tpd_driver_remove(&tpd_device_driver);
}

module_init(tpd_driver_init);
module_exit(tpd_driver_exit);

